DataProcessors/ФормированиеСпискаРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеСпискаРаботников</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяРегистра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСвойстваИКатегории</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУволенных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьУволенных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнятьЗапрос</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыбиратьСотрудника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьДоговорников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияТрудаИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЕТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияДолжности</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Категории</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТабельУчетаОрганизации</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТабеляУчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разряд</Name>
					<Comment>vvv нужен для переноса</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТабельУчетаОрганизацииЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТабеляУчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Comment>Вид учета времени для явки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТСЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТСЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТСЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияДолжностиЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Категории</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкцииЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтомобильЗавершения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Классность</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КлассностиВодителей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеУвольнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненияИзОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаКадровогоПеремещения</Name>
					<Comment>vvv</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныКадровыхПеремещений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ШкалаКоэффициентовСтажа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ШкалаКоэффициентовСтажа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтажС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтажПо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Величина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КоэффициентСтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоэффициентыСтажа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиШкалы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЗанятостиВОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыЗанятостиВОрганизации</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ФормированиеСпискаРаботников/Ext/ObjectModule.bsl
Перем мСоответствиеНазначений Экспорт;

Перем мСтруктураДляОтбораПоКатегориям;

#Если Клиент Тогда

Процедура ЗаполнитьНачальныеНастройки(НачальноеЗаполнение = Истина) Экспорт
	
	// структура представлений полей
	СтруктураПредставлениеПолей = Новый Структура();
	СтруктураФорматаПолей = Новый Структура();
	
	// Для использования свойств и категорий в текст запроса добавляются дополнительные поля

	ТаблицаПолей = Новый ТаблицаЗначений;
	ТаблицаПолей.Колонки.Добавить("ПутьКДанным");  // описание поля запроса поля, для которого добавляются свойства и категории. Используется в условии соединения с регистром сведений, хранящим значения свойств или категорий
	ТаблицаПолей.Колонки.Добавить("Представление");// представление поля, для которого добавляются свойства и категории. 
	ТаблицаПолей.Колонки.Добавить("Назначение");   // назначение свойств/категорий объектов для данного поля
	ТаблицаПолей.Колонки.Добавить("ТипЗначения");  // тип значения поля, для которого добавляются свойства и категории. Используется, если не установлено назначение
	ТаблицаПолей.Колонки.Добавить("НетКатегорий"); // признак НЕиспользования категорий для объекта
	
	мСоответствиеНазначений = Новый Соответствие;
			
	// здесь добавим свойства сотрудника
	НоваяСтрока = ТаблицаПолей.Добавить();
	НоваяСтрока.Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ФизическиеЛица;
	НоваяСтрока.Представление = "физического лица";
	
	Если ИмяРегистра = "РаботникиОрганизаций" Тогда
		
		Если ВыбиратьСотрудника Тогда
			
			// теперь добавим свойства физлица
			НоваяСтрока = ТаблицаПолей.Добавить();
			НоваяСтрока.Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_СотрудникиОрганизаций;
			НоваяСтрока.Представление = "работника";
			
			ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
			|	РаботникиОрганизации.Сотрудник.Наименование КАК ФИО,
			|	РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
			//vvv
			|	Стаж.Коэффициент КАК ПроцентСтажа,
			//
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
			|	КОНЕЦ КАК ГрафикРаботы,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
			|	КОНЕЦ КАК ЗанимаемыхСтавок,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ДолжностьЗавершения
			|		ИНАЧЕ РаботникиОрганизации.Должность
			|	КОНЕЦ КАК Должность,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
			|	КОНЕЦ КАК Подразделение,
			//vvv
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ТабельУчетаОрганизацииЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ТабельУчетаОрганизации
			|	КОНЕЦ КАК Табель,
			//
			|	&ДатаАктуальности КАК ТекущаяДата,
			|	РаботникиОрганизации.Сотрудник.ВидДоговора
			//vvv, добавим, чтобы левое соединение по плановым начислениям было тогда, когда выбрано поле "Вид расчета" в отборе
			| {ВЫБРАТЬ 
			|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
			|	РаботникиОрганизации.Сотрудник.Наименование КАК ФИО,
			|	РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
			|	КОНЕЦ КАК ГрафикРаботы,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
			|	КОНЕЦ КАК ЗанимаемыхСтавок,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ДолжностьЗавершения
			|		ИНАЧЕ РаботникиОрганизации.Должность
			|	КОНЕЦ КАК Должность,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
			|	КОНЕЦ КАК Подразделение,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ТабельУчетаОрганизацииЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ТабельУчетаОрганизации
			|	КОНЕЦ КАК Табель,
			|	ЕСТЬNULL(ВЫРАЗИТЬ(ПлановыеНачисления.ВидРасчетаИзмерение КАК ПланВидовРасчета.ОсновныеНачисленияОрганизаций),ВЫРАЗИТЬ(ПлановыеНачисления.ВидРасчета КАК ПланВидовРасчета.ОсновныеНачисленияОрганизаций)) КАК ВидРасчета,
			|	&ДатаАктуальности КАК ТекущаяДата,
			|	РаботникиОрганизации.Сотрудник.ВидДоговора}
			//vvv а здесь плановые удержания
			| {ВЫБРАТЬ 
			|	РаботникиОрганизации.Сотрудник КАК Сотрудник,
			|	РаботникиОрганизации.Сотрудник.Наименование КАК ФИО,
			|	РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
			|	КОНЕЦ КАК ГрафикРаботы,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
			|	КОНЕЦ КАК ЗанимаемыхСтавок,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ДолжностьЗавершения
			|		ИНАЧЕ РаботникиОрганизации.Должность
			|	КОНЕЦ КАК Должность,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
			|	КОНЕЦ КАК Подразделение,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ТабельУчетаОрганизацииЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ТабельУчетаОрганизации
			|	КОНЕЦ КАК Табель,
			|	ПлановыеУдержания.ВидРасчета КАК Удержание,
			|	&ДатаАктуальности КАК ТекущаяДата,
			|	РаботникиОрганизации.Сотрудник.ВидДоговора}
			//
			|ПОМЕСТИТЬ ВТСписокРаботников
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизации
			//vvv
			//добавим проценты стажа
			|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|	Стажи.Ссылка КАК ФизЛицо,
			|	ШкалаКоэффициентовСтажа.Величина КАК Коэффициент
			|ИЗ
			|	Справочник.ФизическиеЛица.Стажи КАК Стажи
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШкалаКоэффициентовСтажа КАК ШкалаКоэффициентовСтажа
			|		ПО ШкалаКоэффициентовСтажа.КоэффициентСтажа = &КоэффициентСтажа
			|        И (Стажи.РазмерМесяцев + РАЗНОСТЬДАТ(Стажи.ДатаОтсчета, ДОБАВИТЬКДАТЕ(&ДатаАктуальностиСтажа, ДЕНЬ, Стажи.РазмерДней), МЕСЯЦ) - 1>= ШкалаКоэффициентовСтажа.СтажС)
			|			И (Стажи.РазмерМесяцев + РАЗНОСТЬДАТ(Стажи.ДатаОтсчета, ДОБАВИТЬКДАТЕ(&ДатаАктуальностиСтажа, ДЕНЬ, Стажи.РазмерДней), МЕСЯЦ) - ВЫБОР
			|				КОГДА ДЕНЬ(Стажи.ДатаОтсчета) > ДЕНЬ(ДОБАВИТЬКДАТЕ(&ДатаАктуальностиСтажа, ДЕНЬ, Стажи.РазмерДней))
			|					ТОГДА 1
			|				ИНАЧЕ 0
			|			КОНЕЦ < ВЫБОР
			|				КОГДА ШкалаКоэффициентовСтажа.СтажПо = 0
			|					ТОГДА 999999
			|				ИНАЧЕ ШкалаКоэффициентовСтажа.СтажПо
			|			КОНЕЦ)
			|ГДЕ
			|	Стажи.ВидСтажа = &ВидСтажа) КАК Стаж
			|	ПО Стаж.ФизЛицо=РаботникиОрганизации.Сотрудник.Физлицо
			//
			//vvv собственно само левое соединение
			|	{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ДатаАктуальности, Организация = &ГоловнаяОрганизация) КАК ПлановыеНачисления
			|		ПО ПлановыеНачисления.Сотрудник=РаботникиОрганизации.Сотрудник}
			|	{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(&ДатаАктуальности, Организация = &ГоловнаяОрганизация) КАК ПлановыеУдержания
			|		ПО ПлановыеУдержания.ФизЛицо=РаботникиОрганизации.Сотрудник.ФизЛицо
			|		И ПлановыеУдержания.Организация=РаботникиОрганизации.Организация}
			//
			|		{ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			МАКСИМУМ(Работники.Период) КАК Период,
			|			РегистрРаботники.Сотрудник КАК Сотрудник
			|		ИЗ
			|			РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Организация = &ГоловнаяОрганизация) КАК РегистрРаботники
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
			|				ПО (Работники.Период <= РегистрРаботники.Период)
			|					И (Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу))
			|					И РегистрРаботники.Сотрудник = Работники.Сотрудник
			|		{ГДЕ
			|			(ВЫБОР
			|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
			|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|						ТОГДА РегистрРаботники.ДолжностьЗавершения
			|					ИНАЧЕ РегистрРаботники.Должность
			|				КОНЕЦ) КАК Должность,
			|			(ВЫБОР
			|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
			|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|						ТОГДА РегистрРаботники.ГрафикРаботыЗавершения
			|					ИНАЧЕ РегистрРаботники.ГрафикРаботы
			|				КОНЕЦ) КАК ГрафикРаботы,
			|			РегистрРаботники.Сотрудник.Код КАК ТабельныйНомер,
			|			(ВЫБОР
			|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
			|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|						ТОГДА РегистрРаботники.ЗанимаемыхСтавокЗавершения
			|					ИНАЧЕ РегистрРаботники.ЗанимаемыхСтавок
			|				КОНЕЦ) КАК ЗанимаемыхСтавок,
			|			(ВЫБОР
			|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
			|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|						ТОГДА РегистрРаботники.ОбособленноеПодразделениеЗавершения
			|					ИНАЧЕ РегистрРаботники.ОбособленноеПодразделение
			|				КОНЕЦ) КАК ОбособленноеПодразделение,
			|			(ВЫБОР
			|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
			|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|						ТОГДА РегистрРаботники.ПодразделениеОрганизацииЗавершения
			|					ИНАЧЕ РегистрРаботники.ПодразделениеОрганизации
			|				КОНЕЦ) КАК Подразделение}
			|		
			|		СГРУППИРОВАТЬ ПО
			|			РегистрРаботники.Сотрудник) КАК ПриказыОПриеме
			|		ПО РаботникиОрганизации.Сотрудник = ПриказыОПриеме.Сотрудник}
			|		//ДАННЫЕ О ФИЗЛИЦЕ: СОЕДИНЕНИЯ
			|		//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ
			|//УСЛОВИЕ
			|{ГДЕ
			|	РаботникиОрганизации.Сотрудник КАК Работник,
			|	РаботникиОрганизации.Сотрудник.Родитель КАК Группа,
			|	(ВЫБОР
			|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА РаботникиОрганизации.ДолжностьЗавершения
			|			ИНАЧЕ РаботникиОрганизации.Должность
			|		КОНЕЦ).* КАК Должность,
			|	(ВЫБОР
			|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения
			|			ИНАЧЕ РаботникиОрганизации.ГрафикРаботы
			|		КОНЕЦ).* КАК ГрафикРаботы,
			|	РаботникиОрганизации.Сотрудник.Код КАК ТабельныйНомер,
			|	(ВЫБОР
			|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
			|			ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок
			|		КОНЕЦ) КАК ЗанимаемыхСтавок,
			|	ПриказыОПриеме.Период КАК ДатаПриема,
			|	РаботникиОрганизации.Сотрудник.ВидЗанятости КАК ВидЗанятости,
			|	(ВЫБОР
			|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
			|			ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации
			|		КОНЕЦ).* КАК Подразделение,
			//vvv 
			|	(ВЫБОР
			|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА РаботникиОрганизации.ТабельУчетаОрганизацииЗавершения
			|			ИНАЧЕ РаботникиОрганизации.ТабельУчетаОрганизации
			|		КОНЕЦ).* КАК Табель,
			|	ЕСТЬNULL(ВЫРАЗИТЬ(ПлановыеНачисления.ВидРасчетаИзмерение КАК ПланВидовРасчета.ОсновныеНачисленияОрганизаций),ВЫРАЗИТЬ(ПлановыеНачисления.ВидРасчета КАК ПланВидовРасчета.ОсновныеНачисленияОрганизаций)) КАК ВидРасчета,
			|	ПлановыеУдержания.ВидРасчета КАК Удержание,
			//
			|	(ВЫБОР
			|			КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|					И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА РаботникиОрганизации.ОбособленноеПодразделениеЗавершения
			|			ИНАЧЕ РаботникиОрганизации.ОбособленноеПодразделение
			|		КОНЕЦ).* КАК ОбособленноеПодразделение,
			|	РаботникиОрганизации.Сотрудник.ВидДоговора КАК ВидДоговора
			|	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
			|	//СВОЙСТВА
			|	//КАТЕГОРИИ
			|}";
			
			УправлениеОтчетами.ДобавитьВТекстПостроителяДанныеОФизлице(ТекстЗапроса, СтруктураПредставлениеПолей, СтруктураФорматаПолей, "РаботникиОрганизации", "Сотрудник.Физлицо");
			
			// Добавим строки запроса, необходимые для использования свойств и категорий
			ТаблицаПолей[0].ПутьКДанным = "РаботникиОрганизации.Сотрудник.Физлицо";
			ТаблицаПолей[1].ПутьКДанным = "РаботникиОрганизации.Сотрудник";
			ТекстПоляКатегорий = "";
			ТекстПоляСвойств = "";
			УправлениеОтчетами.ДобавитьВТекстСвойстваИКатегории(ТаблицаПолей, ТекстЗапроса, СтруктураПредставлениеПолей, мСоответствиеНазначений, ПостроительОтчета.Параметры,,ТекстПоляКатегорий,ТекстПоляСвойств,,,,"//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ",, мСтруктураДляОтбораПоКатегориям);
			
			Если ВключатьДоговорников Тогда
				
				Если Не ВключатьУволенных Тогда
					
					ТекстЗапроса = ТекстЗапроса + "
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Наименование,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо,
					|	NULL,
					|	NULL,
					|	NULL,
					|	ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации,
					//vvv
					|	NULL,
					|	NULL,
					//
					|	NULL,
					|	NULL
					|ИЗ
					|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
					|		//ДАННЫЕ О ФИЗЛИЦЕ: СОЕДИНЕНИЯ
					|		//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ
					|ГДЕ
					|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &ДатаАктуальности
					|	И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &ДатаАктуальности
					|	И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
					|{ГДЕ
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник КАК Работник,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Родитель КАК Группа,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Код КАК ТабельныйНомер,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ВидЗанятости КАК ВидЗанятости,
					|	ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации.* КАК Подразделение,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Организация.* КАК ОбособленноеПодразделение,
					|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала КАК ДатаПриема,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ВидДоговора КАК ВидДоговора
					|	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
					|	//СВОЙСТВА
					|	//КАТЕГОРИИ
					|}";
					
				Иначе
					
					ТекстЗапроса = ТекстЗапроса + "
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Наименование,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо,
					|	NULL,
					|	NULL,
					|	NULL,
					|	ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации,
					//vvv
					|	NULL,
					|	NULL,
					//
					|	NULL,
					|	NULL
					|ИЗ
					|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
					|		//ДАННЫЕ О ФИЗЛИЦЕ: СОЕДИНЕНИЯ
					|		//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ
					|ГДЕ
					|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &ДатаАктуальности
					|	И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &ДатаУволенных
					|	И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
					|{ГДЕ
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник КАК Работник,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Родитель КАК Группа,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Код КАК ТабельныйНомер,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ВидЗанятости КАК ВидЗанятости,
					|	ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации.* КАК Подразделение,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Организация.* КАК ОбособленноеПодразделение,
					|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала КАК ДатаПриема,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ВидДоговора КАК ВидДоговора
					|	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
					|	//СВОЙСТВА
					|	//КАТЕГОРИИ
					|}";
					
				КонецЕсли;
				
				УправлениеОтчетами.ДобавитьВТекстПостроителяДанныеОФизлице(ТекстЗапроса, СтруктураПредставлениеПолей, СтруктураФорматаПолей, "ДоговорНаВыполнениеРаботСФизЛицом", "Сотрудник.Физлицо");
				
				// Добавим строки запроса, необходимые для использования свойств и категорий
				ТаблицаПолей[0].ПутьКДанным = "ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо";
				ТаблицаПолей[1].ПутьКДанным = "ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник";
				ТекстПоляКатегорий = "";
				ТекстПоляСвойств = "";
				УправлениеОтчетами.ДобавитьВТекстСвойстваИКатегории(ТаблицаПолей, ТекстЗапроса, СтруктураПредставлениеПолей, мСоответствиеНазначений, ПостроительОтчета.Параметры,,ТекстПоляКатегорий,ТекстПоляСвойств,,,,"//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ",, мСтруктураДляОтбораПоКатегориям);
				
			КонецЕсли;
			
		Иначе
			
			ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
			|	РаботникиОрганизации.Сотрудник.Физлицо.Наименование КАК ФИО
			//vvv
			|{ВЫБРАТЬ
			|	РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
			|	ЕСТЬNULL(ВЫРАЗИТЬ(ПлановыеНачисления.ВидРасчетаИзмерение КАК ПланВидовРасчета.ОсновныеНачисленияОрганизаций),ВЫРАЗИТЬ(ПлановыеНачисления.ВидРасчета КАК ПланВидовРасчета.ОсновныеНачисленияОрганизаций)) КАК ВидРасчета,
			|	РаботникиОрганизации.Сотрудник.Физлицо.Наименование КАК ФИО}
			//здесь плановые удержания
			|{ВЫБРАТЬ
			|	РаботникиОрганизации.Сотрудник.Физлицо КАК Физлицо,
			|	ПлановыеУдержания.ВидРасчета КАК Удержание,
			|	РаботникиОрганизации.Сотрудник.Физлицо.Наименование КАК ФИО}
			//
			|ПОМЕСТИТЬ ВТСписокРаботников
			|ИЗ
			|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Организация = &ГоловнаяОрганизация) КАК РаботникиОрганизации
			//vvv собственно само левое соединение
			|	{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияРаботниковОрганизаций.СрезПоследних(&ДатаАктуальности, Организация = &ГоловнаяОрганизация) КАК ПлановыеНачисления
			|		ПО ПлановыеНачисления.Сотрудник=РаботникиОрганизации.Сотрудник}
			|	{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеУдержанияРаботниковОрганизаций.СрезПоследних(&ДатаАктуальности, Организация = &ГоловнаяОрганизация) КАК ПлановыеУдержания
			|		ПО ПлановыеУдержания.ФизЛицо=РаботникиОрганизации.Сотрудник.ФизЛицо
			|		И ПлановыеУдержания.Организация=РаботникиОрганизации.Организация}
			//
			|		{ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				МАКСИМУМ(Работники.Период) КАК Период,
			|				РегистрРаботники.Сотрудник.Физлицо КАК Физлицо
			|			ИЗ
			|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаАктуальности, Организация = &ГоловнаяОрганизация) КАК РегистрРаботники
			|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК Работники
			|					ПО Работники.Период <= РегистрРаботники.Период
			|						И (Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу))
			|						И РегистрРаботники.Сотрудник = Работники.Сотрудник
			|			{ГДЕ
			|				(ВЫБОР
			|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
			|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА РегистрРаботники.ДолжностьЗавершения
			|					ИНАЧЕ РегистрРаботники.Должность 
			|				КОНЕЦ) КАК Должность,
			|				(ВЫБОР
			|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
			|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА РегистрРаботники.ГрафикРаботыЗавершения
			|					ИНАЧЕ РегистрРаботники.ГрафикРаботы 
			|				КОНЕЦ) КАК ГрафикРаботы,
			|				РегистрРаботники.Сотрудник.Код КАК ТабельныйНомер,
			|				ВЫБОР
			|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
			|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА РегистрРаботники.ЗанимаемыхСтавокЗавершения
			|					ИНАЧЕ РегистрРаботники.ЗанимаемыхСтавок 
			|				КОНЕЦ КАК ЗанимаемыхСтавок,
			|				ВЫБОР
			|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
			|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА РегистрРаботники.ОбособленноеПодразделениеЗавершения
			|					ИНАЧЕ РегистрРаботники.ОбособленноеПодразделение 
			|				КОНЕЦ КАК ОбособленноеПодразделение,
			|				ВЫБОР
			|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
			|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА РегистрРаботники.ПодразделениеОрганизацииЗавершения
			|					ИНАЧЕ РегистрРаботники.ПодразделениеОрганизации 
			|				КОНЕЦ КАК Подразделение,
			//vv
			|				ВЫБОР
			|					КОГДА РегистрРаботники.ПериодЗавершения <= &ДатаАктуальности
			|							И РегистрРаботники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА РегистрРаботники.ТабельУчетаОрганизацииЗавершения
			|					ИНАЧЕ РегистрРаботники.ТабельУчетаОрганизации 
			|				КОНЕЦ КАК ТабельУчета}
			//
			|			
			|			СГРУППИРОВАТЬ ПО
			|				РегистрРаботники.Сотрудник.Физлицо) КАК ПриказыОПриеме
			|		ПО РаботникиОрганизации.Сотрудник.Физлицо = ПриказыОПриеме.Физлицо}
			|		//ДАННЫЕ О ФИЗЛИЦЕ: СОЕДИНЕНИЯ
			|		//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ
			|//УСЛОВИЕ
			|{ГДЕ
			|	РаботникиОрганизации.Сотрудник КАК Работник,
			|	РаботникиОрганизации.Сотрудник.Родитель КАК Группа,
			|	(ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|		ТОГДА РаботникиОрганизации.ДолжностьЗавершения
			|		ИНАЧЕ РаботникиОрганизации.Должность 
			|	КОНЕЦ).* КАК Должность,
			|	(ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|		ТОГДА РаботникиОрганизации.ГрафикРаботыЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ГрафикРаботы 
			|	КОНЕЦ).* КАК ГрафикРаботы,
			|	РаботникиОрганизации.Сотрудник.Код КАК ТабельныйНомер,
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|		ТОГДА РаботникиОрганизации.ЗанимаемыхСтавокЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ЗанимаемыхСтавок 
			|	КОНЕЦ КАК ЗанимаемыхСтавок,
			|	ПриказыОПриеме.Период КАК ДатаПриема,
			|	РаботникиОрганизации.Сотрудник.ВидЗанятости КАК ВидЗанятости,
			|	(ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|		ТОГДА РаботникиОрганизации.ПодразделениеОрганизацииЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ПодразделениеОрганизации 
			|	КОНЕЦ).* КАК Подразделение,
			//vvv
			|	(ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|		ТОГДА РаботникиОрганизации.ТабельУчетаОрганизацииЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ТабельУчетаОрганизации 
			|	КОНЕЦ).* КАК Табель,
			|	ЕСТЬNULL(ВЫРАЗИТЬ(ПлановыеНачисления.ВидРасчетаИзмерение КАК ПланВидовРасчета.ОсновныеНачисленияОрганизаций),ВЫРАЗИТЬ(ПлановыеНачисления.ВидРасчета КАК ПланВидовРасчета.ОсновныеНачисленияОрганизаций)) КАК ВидРасчета,
			|	ПлановыеУдержания.ВидРасчета КАК Удержание,
			//
			|	(ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|		ТОГДА РаботникиОрганизации.ОбособленноеПодразделениеЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ОбособленноеПодразделение 
			|	КОНЕЦ).* КАК ОбособленноеПодразделение
			|	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
			|	//СВОЙСТВА
			|	//КАТЕГОРИИ
			|}
			|
			|";
			
			УправлениеОтчетами.ДобавитьВТекстПостроителяДанныеОФизлице(ТекстЗапроса, СтруктураПредставлениеПолей, СтруктураФорматаПолей, "РаботникиОрганизации", "Сотрудник.Физлицо");
			
			// Добавим строки запроса, необходимые для использования свойств и категорий
			ТаблицаПолей[0].ПутьКДанным = "РаботникиОрганизации.Сотрудник.Физлицо";
			ТекстПоляКатегорий = "";
			ТекстПоляСвойств = "";
			УправлениеОтчетами.ДобавитьВТекстСвойстваИКатегории(ТаблицаПолей, ТекстЗапроса, СтруктураПредставлениеПолей, мСоответствиеНазначений, ПостроительОтчета.Параметры,,ТекстПоляКатегорий,ТекстПоляСвойств,,,,"//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ",, мСтруктураДляОтбораПоКатегориям);
			
			Если ВключатьДоговорников Тогда
				
				Если Не ВключатьУволенных Тогда
					
					ТекстЗапроса = ТекстЗапроса + "
					|
					|ОБЪЕДИНИТЬ
					|
					|ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо.Наименование
					|ИЗ
					|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
					|		//ДАННЫЕ О ФИЗЛИЦЕ: СОЕДИНЕНИЯ
					|		//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ
					|ГДЕ
					|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &ДатаАктуальности
					|	И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &ДатаАктуальности
					|	И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
					|{ГДЕ
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник КАК Работник,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Родитель КАК Группа,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Код КАК ТабельныйНомер,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ВидЗанятости КАК ВидЗанятости,
					|	ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации.* КАК Подразделение,
					//vvv
					|	NULL,
					//
					|	ДоговорНаВыполнениеРаботСФизЛицом.Организация.* КАК ОбособленноеПодразделение,
					|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала КАК ДатаПриема
					|	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
					|	//СВОЙСТВА
					|	//КАТЕГОРИИ
					|}";
					
				Иначе
					
					ТекстЗапроса = ТекстЗапроса + "
					|
					|ОБЪЕДИНИТЬ
					|
					|ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо.Наименование
					|ИЗ
					|	Документ.ДоговорНаВыполнениеРаботСФизЛицом КАК ДоговорНаВыполнениеРаботСФизЛицом
					|		//ДАННЫЕ О ФИЗЛИЦЕ: СОЕДИНЕНИЯ
					|		//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ
					|ГДЕ
					|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала <= &ДатаАктуальности
					|	И ДоговорНаВыполнениеРаботСФизЛицом.ДатаОкончания >= &ДатаУволенных
					|	И ДоговорНаВыполнениеРаботСФизЛицом.Проведен
					|{ГДЕ
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник КАК Работник,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Родитель КАК Группа,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Код КАК ТабельныйНомер,
					|	ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.ВидЗанятости КАК ВидЗанятости,
					|	ДоговорНаВыполнениеРаботСФизЛицом.ПодразделениеОрганизации.* КАК Подразделение,
					//vvv
					|	NULL,
					//
					|	ДоговорНаВыполнениеРаботСФизЛицом.Организация.* КАК ОбособленноеПодразделение,
					|	ДоговорНаВыполнениеРаботСФизЛицом.ДатаНачала КАК ДатаПриема
					|	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
					|	//СВОЙСТВА
					|	//КАТЕГОРИИ
					|}";
					
				КонецЕсли;
				
				УправлениеОтчетами.ДобавитьВТекстПостроителяДанныеОФизлице(ТекстЗапроса, СтруктураПредставлениеПолей, СтруктураФорматаПолей, "ДоговорНаВыполнениеРаботСФизЛицом", "Сотрудник.Физлицо");
				
				// Добавим строки запроса, необходимые для использования свойств и категорий
				ТаблицаПолей[0].ПутьКДанным = "ДоговорНаВыполнениеРаботСФизЛицом.Сотрудник.Физлицо";
				ТекстПоляКатегорий = "";
				ТекстПоляСвойств = "";
				УправлениеОтчетами.ДобавитьВТекстСвойстваИКатегории(ТаблицаПолей, ТекстЗапроса, СтруктураПредставлениеПолей, мСоответствиеНазначений, ПостроительОтчета.Параметры,,ТекстПоляКатегорий,ТекстПоляСвойств,,,,"//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ",, мСтруктураДляОтбораПоКатегориям);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ВключатьУволенных Тогда
			СтрокаУсловия =
			"ГДЕ
			|	ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ПричинаИзмененияСостоянияЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ПричинаИзмененияСостояния
			|	КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|";
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//УСЛОВИЕ", СтрокаУсловия);
			
		ИначеЕсли ЗначениеЗаполнено(ДатаУволенных) Тогда
			СтрокаУсловия =
			"ГДЕ
			|	(ВЫБОР
			|		КОГДА РаботникиОрганизации.ПериодЗавершения <= &ДатаАктуальности
			|				И РаботникиОрганизации.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|			ТОГДА РаботникиОрганизации.ПричинаИзмененияСостоянияЗавершения
			|		ИНАЧЕ РаботникиОрганизации.ПричинаИзмененияСостояния
			|	КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) ИЛИ (РаботникиОрганизации.Период > &ДатаУволенных)
			|";
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//УСЛОВИЕ", СтрокаУсловия);
			
		КонецЕсли;
		
	Иначе
		
		Если ВыбиратьСотрудника Тогда
			ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	Сотрудники.Сотрудник КАК Сотрудник,
			|	Сотрудники.Сотрудник.Наименование КАК ФИО,
			|	РаботникиОрганизации.ФизЛицо КАК Физлицо,
			|	РаботникиОрганизации.ГрафикРаботы,
			|	РаботникиОрганизации.ЗанимаемыхСтавок,
			|	РаботникиОрганизации.Должность,
			|	РаботникиОрганизации.Подразделение КАК Подразделение
			|ПОМЕСТИТЬ ВТСписокРаботников
			|ИЗ
			|	РегистрСведений.Работники.СрезПоследних(&ДатаАктуальности, ) КАК РаботникиОрганизации
			|		{ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				МАКСИМУМ(Работники.Период) КАК Период,
			|				РегистрРаботники.ФизЛицо КАК Физлицо
			|			ИЗ
			|				РегистрСведений.Работники.СрезПоследних(&ДатаАктуальности, ) КАК РегистрРаботники
			|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники
			|					ПО РегистрРаботники.ФизЛицо = Работники.ФизЛицо
			|						И Работники.Период <= РегистрРаботники.Период
			|						И (Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу))
			|			{ГДЕ
			|				РегистрРаботники.Должность КАК Должность,
			|				РегистрРаботники.ГрафикРаботы КАК ГрафикРаботы,
			|				РегистрРаботники.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
			|				РегистрРаботники.Подразделение КАК Подразделение}
			|			
			|			СГРУППИРОВАТЬ ПО
			|				РегистрРаботники.ФизЛицо) КАК ПриказыОПриеме
			|		ПО ПриказыОПриеме.Физлицо = РаботникиОрганизации.ФизЛицо}
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			СписокСотрудников.Сотрудник КАК Сотрудник,
			|			СписокСотрудников.Физлицо КАК Физлицо
			|		ИЗ
			|			(ВЫБРАТЬ
			|				МАКСИМУМ(РаботникиОсновноеМесто.Сотрудник) КАК Сотрудник,
			|				РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
			|				1 КАК Приоритет
			|			ИЗ
			|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			|					&ДатаАктуальности,
			|					Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
			|			ГДЕ
			|				ВЫБОР
			|					КОГДА РаботникиОсновноеМесто.ПериодЗавершения <= &ДатаАктуальности
			|						И РаботникиОсновноеМесто.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА РаботникиОсновноеМесто.ПричинаИзмененияСостоянияЗавершения
			|					ИНАЧЕ РаботникиОсновноеМесто.ПричинаИзмененияСостояния 
			|				КОНЕЦ  <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|			
			|			СГРУППИРОВАТЬ ПО
			|				РаботникиОсновноеМесто.Сотрудник.Физлицо
			|			
			|			ОБЪЕДИНИТЬ
			|			
			|			ВЫБРАТЬ
			|				МАКСИМУМ(РаботникиСовместительство.Сотрудник),
			|				РаботникиСовместительство.Сотрудник.Физлицо,
			|				2
			|			ИЗ
			|				РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			|					&ДатаАктуальности,
			|					Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
			|			ГДЕ
			|				ВЫБОР
			|					КОГДА РаботникиСовместительство.ПериодЗавершения <= &ДатаАктуальности
			|						И РаботникиСовместительство.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|					ТОГДА РаботникиСовместительство.ПричинаИзмененияСостоянияЗавершения
			|					ИНАЧЕ РаботникиСовместительство.ПричинаИзмененияСостояния 
			|				КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|			
			|			СГРУППИРОВАТЬ ПО
			|				РаботникиСовместительство.Сотрудник.Физлицо
			|			
			|			ОБЪЕДИНИТЬ
			|			
			|			ВЫБРАТЬ
			|				МАКСИМУМ(СотрудникиДУ.Ссылка),
			|				СотрудникиДУ.Физлицо,
			|				ВЫБОР
			|					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			|						ТОГДА 3
			|					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|						ТОГДА 4
			|					ИНАЧЕ 5
			|				КОНЕЦ
			|			ИЗ
			|				Справочник.СотрудникиОрганизаций КАК СотрудникиДУ
			|			
			|			СГРУППИРОВАТЬ ПО
			|				СотрудникиДУ.Физлицо,
			|				ВЫБОР
			|					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			|						ТОГДА 3
			|					КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|						ТОГДА 4
			|					ИНАЧЕ 5
			|				КОНЕЦ) КАК СписокСотрудников
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|					СписокФизическихЛиц.Физлицо КАК Физлицо,
			|					МИНИМУМ(СписокФизическихЛиц.Приоритет) КАК Приоритет
			|				ИЗ
			|					(ВЫБРАТЬ
			|						РаботникиОсновноеМесто.Сотрудник.Физлицо КАК Физлицо,
			|						1 КАК Приоритет
			|					ИЗ
			|						РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			|							&ДатаАктуальности,
			|							Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|								И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы)) КАК РаботникиОсновноеМесто
			|					ГДЕ
			|						ВЫБОР
			|							КОГДА РаботникиОсновноеМесто.ПериодЗавершения <= &ДатаАктуальности
			|								И РаботникиОсновноеМесто.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|							ТОГДА РаботникиОсновноеМесто.ПричинаИзмененияСостоянияЗавершения
			|							ИНАЧЕ РаботникиОсновноеМесто.ПричинаИзмененияСостояния 
			|						КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|					
			|					ОБЪЕДИНИТЬ
			|					
			|					ВЫБРАТЬ
			|						РаботникиСовместительство.Сотрудник.Физлицо,
			|						2
			|					ИЗ
			|						РегистрСведений.РаботникиОрганизаций.СрезПоследних(
			|							&ДатаАктуальности,
			|							Сотрудник.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|								И Сотрудник.ВидЗанятости = ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.Совместительство)) КАК РаботникиСовместительство
			|					ГДЕ
			|						ВЫБОР
			|							КОГДА РаботникиСовместительство.ПериодЗавершения <= &ДатаАктуальности
			|								И РаботникиСовместительство.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|							ТОГДА РаботникиСовместительство.ПричинаИзмененияСостоянияЗавершения
			|							ИНАЧЕ РаботникиСовместительство.ПричинаИзмененияСостояния 
			|						КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|					
			|					ОБЪЕДИНИТЬ
			|					
			|					ВЫБРАТЬ
			|						СотрудникиДУ.Физлицо,
			|						ВЫБОР
			|							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ДоговорУправленческий)
			|								ТОГДА 3
			|							КОГДА СотрудникиДУ.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровСФизЛицами.ТрудовойДоговор)
			|								ТОГДА 4
			|							ИНАЧЕ 5
			|						КОНЕЦ
			|					ИЗ
			|						Справочник.СотрудникиОрганизаций КАК СотрудникиДУ) КАК СписокФизическихЛиц
			|				
			|				СГРУППИРОВАТЬ ПО
			|					СписокФизическихЛиц.Физлицо) КАК СписокФизическихЛиц
			|				ПО СписокСотрудников.Физлицо = СписокФизическихЛиц.Физлицо
			|					И СписокСотрудников.Приоритет = СписокФизическихЛиц.Приоритет) КАК Сотрудники
			|		ПО РаботникиОрганизации.ФизЛицо = Сотрудники.Физлицо
			|		//ДАННЫЕ О ФИЗЛИЦЕ: СОЕДИНЕНИЯ
			|		//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ
			|//УСЛОВИЕ
			|{ГДЕ
			|	Сотрудники.Сотрудник КАК Работник,
			|	Сотрудники.Сотрудник.Родитель КАК Группа,
			|	РаботникиОрганизации.Должность.* КАК Должность,
			|	РаботникиОрганизации.ГрафикРаботы.* КАК ГрафикРаботы,
			|	РаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
			|	ПриказыОПриеме.Период КАК ДатаПриема,
			|	РаботникиОрганизации.Подразделение КАК Подразделение
			|	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
			|	//СВОЙСТВА
			|	//КАТЕГОРИИ
			|}
			|";
			
		Иначе
			ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	РаботникиОрганизации.Физлицо КАК Физлицо,
			|	РаботникиОрганизации.Физлицо.Наименование КАК ФИО
			|ПОМЕСТИТЬ ВТСписокРаботников
			|ИЗ
			|	РегистрСведений.Работники.СрезПоследних(&ДатаАктуальности, ) КАК РаботникиОрганизации
			|		{ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				МАКСИМУМ(Работники.Период) КАК Период,
			|				РегистрРаботники.Физлицо КАК Физлицо
			|			ИЗ
			|				РегистрСведений.Работники.СрезПоследних(&ДатаАктуальности) КАК РегистрРаботники
			|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Работники КАК Работники
			|					ПО РегистрРаботники.Физлицо = Работники.Физлицо
			|						И Работники.Период <= РегистрРаботники.Период
			|						И (Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу))
			|			{ГДЕ
			|				РегистрРаботники.Должность КАК Должность,
			|				РегистрРаботники.ГрафикРаботы КАК ГрафикРаботы,
			|				РегистрРаботники.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
			|				РегистрРаботники.Подразделение КАК Подразделение}
			|			
			|			СГРУППИРОВАТЬ ПО
			|				РегистрРаботники.Физлицо) КАК ПриказыОПриеме
			|		ПО ПриказыОПриеме.Физлицо = РаботникиОрганизации.Физлицо}
			|		//ДАННЫЕ О ФИЗЛИЦЕ: СОЕДИНЕНИЯ
			|		//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ
			|//УСЛОВИЕ
			|{ГДЕ
			|	РаботникиОрганизации.Физлицо КАК Работник,
			|	РаботникиОрганизации.Физлицо.Родитель КАК Группа,
			|	РаботникиОрганизации.Должность.* КАК Должность,
			|	РаботникиОрганизации.ГрафикРаботы.* КАК ГрафикРаботы,
			|	РаботникиОрганизации.ЗанимаемыхСтавок КАК ЗанимаемыхСтавок,
			|	ПриказыОПриеме.Период КАК ДатаПриема,
			|	РаботникиОрганизации.Подразделение КАК Подразделение
			|	//ДАННЫЕ О ФИЗЛИЦЕ: ПОЛЯ
			|	//СВОЙСТВА
			|	//КАТЕГОРИИ
			|}
			|
			|";
			
		КонецЕсли;
	
		Если Не ВключатьУволенных Тогда
			СтрокаУсловия =
			"ГДЕ
			|	РаботникиОрганизации.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
			|";
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//УСЛОВИЕ", СтрокаУсловия);
			
		ИначеЕсли ЗначениеЗаполнено(ДатаУволенных) Тогда
			СтрокаУсловия =
			"ГДЕ
			|	(РаботникиОрганизации.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) ИЛИ (РаботникиОрганизации.Период > &ДатаУволенных)
			|";
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//УСЛОВИЕ", СтрокаУсловия);
			
		КонецЕсли;
	
		// Преобразуем текст запроса для получения полной информации о физлице
		УправлениеОтчетами.ДобавитьВТекстПостроителяДанныеОФизлице(ТекстЗапроса, СтруктураПредставлениеПолей, СтруктураФорматаПолей, "РаботникиОрганизации", "Физлицо");
		
		Если ВыбиратьСотрудника Тогда  // здесь добавим свойства сотрудника
			НоваяСтрока.ПутьКДанным = "Сотрудники.Сотрудник";
			НоваяСтрока.Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_СотрудникиОрганизаций;
			НоваяСтрока = ТаблицаПолей.Добавить();
			НоваяСтрока.Представление = "физического лица";
		КонецЕсли;
		// теперь добавим свойства физлица
		НоваяСтрока.ПутьКДанным = "РаботникиОрганизации.Физлицо";
		НоваяСтрока.Назначение = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ФизическиеЛица;
		
		// Добавим строки запроса, необходимые для использования свойств и категорий
		ТекстПоляКатегорий = "";
		ТекстПоляСвойств = "";
		УправлениеОтчетами.ДобавитьВТекстСвойстваИКатегории(ТаблицаПолей, ТекстЗапроса, СтруктураПредставлениеПолей, мСоответствиеНазначений, ПостроительОтчета.Параметры,,ТекстПоляКатегорий,ТекстПоляСвойств,,,,"//СОЕДИНЕНИЯ СВОЙСТВ И КАТЕГОРИЙ",, мСтруктураДляОтбораПоКатегориям);
		
	КонецЕсли;
	
	Если ИсполнятьЗапрос Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"ПОМЕСТИТЬ ВТСписокРаботников","") + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	ФИО";
	ИначеЕсли ВыбиратьСотрудника Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Сотрудник";
	Иначе 
		ТекстЗапроса = ТекстЗапроса + "
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Физлицо";
	КонецЕсли;
	
	ПостроительОтчета.Текст = ТекстЗапроса;
	
	УправлениеОтчетами.УстановитьТипыЗначенийСвойствИКатегорийДляОтбора(ПостроительОтчета, ТекстПоляКатегорий, ТекстПоляСвойств, мСоответствиеНазначений, СтруктураПредставлениеПолей);
	
	//представление полей запроса
	СтруктураПредставлениеПолей.Вставить("Группа",						"Группа сотрудников");
	СтруктураПредставлениеПолей.Вставить("ОбособленноеПодразделение",	"Организация");
	СтруктураПредставлениеПолей.Вставить("ДатаПриема",					"Дата приема");
	СтруктураПредставлениеПолей.Вставить("ГрафикРаботы",				"График работы");
	СтруктураПредставлениеПолей.Вставить("ЗанимаемыхСтавок",			"Занимаемых ставок");
	//vvv
	СтруктураПредставлениеПолей.Вставить("ВидРасчета",			        "План. начисление");
	СтруктураПредставлениеПолей.Вставить("Удержание",			        "План. удержание");
	//
	Если ИмяРегистра = "РаботникиОрганизаций" Тогда 
		СтруктураПредставлениеПолей.Вставить("ВидЗанятости",			"Вид занятости");
	КонецЕсли;
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	
	Если НачальноеЗаполнение Тогда
		// отборы по умолчанию
		МассивОтбора = Новый Массив;
		Если ИмяРегистра = "РаботникиОрганизаций" Тогда
			МассивОтбора.Добавить("ОбособленноеПодразделение");
		КонецЕсли;
		МассивОтбора.Добавить("Подразделение");
		МассивОтбора.Добавить("Должность");
		//vvv
		МассивОтбора.Добавить("Табель");
		МассивОтбора.Добавить("ВидРасчета");
		МассивОтбора.Добавить("Удержание");
		//
		МассивОтбора.Добавить("Работник");
		УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
		ПостроительОтчета.Отбор.Работник.ВидСравнения = ВидСравнения.ВСписке;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСписокРаботников() Экспорт
	
	Если НЕ УправлениеОтчетами.ЗадатьПараметрыОтбораПоКатегориям(ПостроительОтчета, мСтруктураДляОтбораПоКатегориям) Тогда
		//повторные отборы по категориям
		Возврат Новый Структура("Команда,Данные,Реквизиты","ЗаполнитьСписокРаботников");
	КонецЕсли;
	
	ПостроительОтчета.Параметры.Вставить("ДатаАктуальности", ДатаАктуальности);
	//vvv
	ПостроительОтчета.Параметры.Вставить("ДатаАктуальностиСтажа", НачалоГода(ДатаАктуальности));
	ПостроительОтчета.Параметры.Вставить("КоэффициентСтажа",Справочники.КоэффициентыСтажа.НайтиПоНаименованию("Выслуга лет"));
	ПостроительОтчета.Параметры.Вставить("ВидСтажа",Справочники.ВидыСтажа.СтажНаНадбавкуЗаВыслугуЛет);
	Если Реквизиты<>Неопределено ТОгда
		Если Реквизиты.Свойство("КоэффициентСтажа") ТОгда
			ПостроительОтчета.Параметры.Вставить("КоэффициентСтажа",Реквизиты.КоэффициентСтажа);
		КонецЕсли;
		Если Реквизиты.Свойство("ВидСтажа") ТОгда
			ПостроительОтчета.Параметры.Вставить("ВидСтажа",Реквизиты.ВидСтажа);
		КонецЕсли;
	КонецЕсли;
	//
	ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_Год", Год(ДатаАктуальности));
	ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_Месяц", Месяц(ДатаАктуальности));
	ПостроительОтчета.Параметры.Вставить("ДатаАктуальности_День", День(ДатаАктуальности));
	ПостроительОтчета.Параметры.Вставить("ДатаУволенных", ДатаУволенных);
	
	Если ИсполнятьЗапрос Тогда
		
		ПостроительОтчета.Выполнить();
		РезультатОтбора = ПостроительОтчета.Результат;
		Если РезультатОтбора.Пустой() Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не обнаружено работников, удовлетворяющих указанным условиям!");
		КонецЕсли;
		
		Возврат Новый Структура("Команда,Данные,Реквизиты","ЗаполнитьСписокРаботников",РезультатОтбора,Реквизиты)
	Иначе
		Возврат Новый Структура("Команда,Запрос,Реквизиты","ИсполнитьПодготовленныйЗапрос",ПостроительОтчета.ПолучитьЗапрос(),Реквизиты)
	КонецЕсли;
	
КонецФункции // ПолучитьСписокРаботников()

#КонецЕсли
